Revit 2024 API
BasicFileInfo.Format Property
 The file format indicator (currently, the major release version such as "2019") used for saving the file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public string Format { get; }
Visual Basic
Public ReadOnly Property Format As String
	Get
Visual C++
public:
property String^ Format {
	String^ get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace